Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_comp.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32L4R5_comp equates.
 */

#pragma once

#include    <stdint.h>

// COMP address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    COMP1_CSR;
    volatile    uint32_t    COMP2_CSR;
} COMP_TypeDef;

#ifdef __cplusplus
#define COMP    reinterpret_cast<COMP_TypeDef *>(0x40010200U)

#else
#define COMP    ((COMP_TypeDef *)0x40010200U)
#endif

// COMP1_CSR Configuration

#define COMP_COMP1_CSR_COMP1_LOCK       (0x1U<<31U)
#define COMP_COMP1_CSR_COMP1_VALUE      (0x1U<<30U)
#define COMP_COMP1_CSR_COMP1_SCALEN     (0x1U<<23U)
#define COMP_COMP1_CSR_COMP1_BRGEN      (0x1U<<22U)
#define COMP_COMP1_CSR_COMP1_BLANKING   (0x7U<<18U)
#define COMP_COMP1_CSR_COMP1_BLANKING_0 (0x1U<<18U)
#define COMP_COMP1_CSR_COMP1_HYST       (0x3U<<16U)
#define COMP_COMP1_CSR_COMP1_HYST_0     (0x1U<<16U)
#define COMP_COMP1_CSR_COMP1_POLARITY   (0x1U<<15U)
#define COMP_COMP1_CSR_COMP1_INPSEL     (0x1U<<7U)
#define COMP_COMP1_CSR_COMP1_INMSEL     (0x7U<<4U)
#define COMP_COMP1_CSR_COMP1_INMSEL_0   (0x1U<<4U)
#define COMP_COMP1_CSR_COMP1_PWRMODE    (0x3U<<2U)
#define COMP_COMP1_CSR_COMP1_PWRMODE_0  (0x1U<<2U)
#define COMP_COMP1_CSR_COMP1_EN         (0x1U<<0U)

// COMP2_CSR Configuration

#define COMP_COMP2_CSR_COMP2_LOCK       (0x1U<<31U)
#define COMP_COMP2_CSR_COMP2_VALUE      (0x1U<<30U)
#define COMP_COMP2_CSR_COMP2_SCALEN     (0x1U<<23U)
#define COMP_COMP2_CSR_COMP2_BRGEN      (0x1U<<22U)
#define COMP_COMP2_CSR_COMP2_BLANKING   (0x7U<<18U)
#define COMP_COMP2_CSR_COMP2_BLANKING_0 (0x1U<<18U)
#define COMP_COMP2_CSR_COMP2_HYST       (0x3U<<16U)
#define COMP_COMP2_CSR_COMP2_HYST_0     (0x1U<<16U)
#define COMP_COMP2_CSR_COMP2_POLARITY   (0x1U<<15U)
#define COMP_COMP2_CSR_COMP2_WINMODE    (0x1U<<9U)
#define COMP_COMP2_CSR_COMP2_INPSEL     (0x1U<<7U)
#define COMP_COMP2_CSR_COMP2_INMSEL     (0x7U<<4U)
#define COMP_COMP2_CSR_COMP2_INMSEL_0   (0x1U<<4U)
#define COMP_COMP2_CSR_COMP2_PWRMODE    (0x3U<<2U)
#define COMP_COMP2_CSR_COMP2_PWRMODE_0  (0x1U<<2U)
#define COMP_COMP2_CSR_COMP2_EN         (0x1U<<0U)
